; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v8 ?v12)
             (pred_12 ?v6 ?v10)
             (pred_1 ?v8 ?v10)
             (pred_4 ?v4 ?v8 )
	     (pred_2 ?v8)
             (pred_10 ?v11)
             (pred_3 ?v6)
             (pred_8 ?v10)
             (pred_6 ?v8)
             (pred_9 ?v6)
             (pred_5 ?v8)
             (pred_7 ))



(:action op_3
:parameters (?v3 ?v13 ?v1 ?v5)
:precondition (and (pred_10 ?v3) (pred_10 ?v13) (pred_3 ?v1) (pred_8 ?v5)
          (pred_11 ?v3 ?v13) (pred_12 ?v1 ?v5)
                   (pred_1 ?v13 ?v5) (pred_2 ?v3) 
                   (pred_6 ?v13) (pred_9 ?v1))
:effect (and  (pred_5 ?v13) (not (pred_6 ?v13))))


(:action op_1
:parameters (?v3 ?v9)
:precondition (and (pred_10 ?v3) (pred_10 ?v9)
               (pred_2 ?v3) (pred_11 ?v3 ?v9) (pred_5 ?v9))
:effect (and (pred_2 ?v9) (not (pred_2 ?v3))))

(:action op_4
:parameters (?v3 ?v1)
:precondition (and (pred_10 ?v3) (pred_3 ?v1) 
                  (pred_2 ?v3) (pred_4 ?v1 ?v3) (pred_7 ))
:effect (and (pred_9 ?v1)
   (not (pred_4 ?v1 ?v3)) (not (pred_7 ))))


(:action op_5
:parameters (?v3 ?v2 ?v7)
:precondition (and (pred_10 ?v3) (pred_3 ?v2) (pred_3 ?v7)
                  (pred_2 ?v3) (pred_9 ?v7) (pred_4 ?v2 ?v3))
:effect (and (pred_9 ?v2) (pred_4 ?v7 ?v3)
        (not (pred_9 ?v7)) (not (pred_4 ?v2 ?v3))))

(:action op_2
:parameters (?v3 ?v1)
:precondition (and (pred_10 ?v3) (pred_3 ?v1) 
                  (pred_2 ?v3) (pred_9 ?v1))
:effect (and (pred_7 ) (pred_4 ?v1 ?v3) (not (pred_9 ?v1)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_25 obj_02 obj_08 obj_28 obj_21 obj_22 obj_23 obj_06 obj_11 obj_27 obj_19 obj_24 obj_20 obj_01 obj_30 obj_15 obj_17 obj_03 obj_18 obj_12 obj_26 obj_16 obj_29 obj_09 obj_05
    obj_04 obj_14 obj_13
    obj_07 obj_31 obj_10 obj_32
    )

    (:init
       (pred_7)

       (pred_10 obj_25)
       (pred_10 obj_02)
       (pred_10 obj_08)
       (pred_10 obj_28)
       (pred_10 obj_21)
       (pred_10 obj_22)
       (pred_10 obj_23)
       (pred_10 obj_06)
       (pred_10 obj_11)
       (pred_10 obj_27)
       (pred_10 obj_19)
       (pred_10 obj_24)
       (pred_10 obj_20)
       (pred_10 obj_01)
       (pred_10 obj_30)
       (pred_10 obj_15)
       (pred_10 obj_17)
       (pred_10 obj_03)
       (pred_10 obj_18)
       (pred_10 obj_12)
       (pred_10 obj_26)
       (pred_10 obj_16)
       (pred_10 obj_29)
       (pred_10 obj_09)
       (pred_10 obj_05)
       (pred_8 obj_04)
       (pred_8 obj_14)
       (pred_8 obj_13)
       (pred_3 obj_07)
       (pred_3 obj_31)
       (pred_3 obj_10)
       (pred_3 obj_32)

       (pred_11 obj_25 obj_22)
       (pred_11 obj_25 obj_02)
       (pred_11 obj_02 obj_23)
       (pred_11 obj_02 obj_08)
       (pred_11 obj_02 obj_25)
       (pred_11 obj_08 obj_06)
       (pred_11 obj_08 obj_28)
       (pred_11 obj_08 obj_02)
       (pred_11 obj_28 obj_11)
       (pred_11 obj_28 obj_21)
       (pred_11 obj_28 obj_08)
       (pred_11 obj_21 obj_27)
       (pred_11 obj_21 obj_28)
       (pred_11 obj_22 obj_19)
       (pred_11 obj_22 obj_23)
       (pred_11 obj_22 obj_25)
       (pred_11 obj_23 obj_24)
       (pred_11 obj_23 obj_06)
       (pred_11 obj_23 obj_02)
       (pred_11 obj_23 obj_22)
       (pred_11 obj_06 obj_20)
       (pred_11 obj_06 obj_11)
       (pred_11 obj_06 obj_08)
       (pred_11 obj_06 obj_23)
       (pred_11 obj_11 obj_01)
       (pred_11 obj_11 obj_27)
       (pred_11 obj_11 obj_28)
       (pred_11 obj_11 obj_06)
       (pred_11 obj_27 obj_30)
       (pred_11 obj_27 obj_21)
       (pred_11 obj_27 obj_11)
       (pred_11 obj_19 obj_15)
       (pred_11 obj_19 obj_24)
       (pred_11 obj_19 obj_22)
       (pred_11 obj_24 obj_17)
       (pred_11 obj_24 obj_20)
       (pred_11 obj_24 obj_23)
       (pred_11 obj_24 obj_19)
       (pred_11 obj_20 obj_03)
       (pred_11 obj_20 obj_01)
       (pred_11 obj_20 obj_06)
       (pred_11 obj_20 obj_24)
       (pred_11 obj_01 obj_18)
       (pred_11 obj_01 obj_30)
       (pred_11 obj_01 obj_11)
       (pred_11 obj_01 obj_20)
       (pred_11 obj_30 obj_12)
       (pred_11 obj_30 obj_27)
       (pred_11 obj_30 obj_01)
       (pred_11 obj_15 obj_26)
       (pred_11 obj_15 obj_17)
       (pred_11 obj_15 obj_19)
       (pred_11 obj_17 obj_16)
       (pred_11 obj_17 obj_03)
       (pred_11 obj_17 obj_24)
       (pred_11 obj_17 obj_15)
       (pred_11 obj_03 obj_29)
       (pred_11 obj_03 obj_18)
       (pred_11 obj_03 obj_20)
       (pred_11 obj_03 obj_17)
       (pred_11 obj_18 obj_09)
       (pred_11 obj_18 obj_12)
       (pred_11 obj_18 obj_01)
       (pred_11 obj_18 obj_03)
       (pred_11 obj_12 obj_05)
       (pred_11 obj_12 obj_30)
       (pred_11 obj_12 obj_18)
       (pred_11 obj_26 obj_16)
       (pred_11 obj_26 obj_15)
       (pred_11 obj_16 obj_29)
       (pred_11 obj_16 obj_17)
       (pred_11 obj_16 obj_26)
       (pred_11 obj_29 obj_09)
       (pred_11 obj_29 obj_03)
       (pred_11 obj_29 obj_16)
       (pred_11 obj_09 obj_05)
       (pred_11 obj_09 obj_18)
       (pred_11 obj_09 obj_29)
       (pred_11 obj_05 obj_12)
       (pred_11 obj_05 obj_09)
       (pred_6 obj_21)
       (pred_6 obj_05)
       (pred_6 obj_24)
       (pred_6 obj_30)
       (pred_1  obj_21 obj_04)
       (pred_1  obj_05 obj_14)
       (pred_1  obj_24 obj_13)
       (pred_1  obj_30 obj_14)
       (pred_5 obj_25)
       (pred_5 obj_02)
       (pred_5 obj_08)
       (pred_5 obj_28)
       (pred_5 obj_22)
       (pred_5 obj_23)
       (pred_5 obj_06)
       (pred_5 obj_11)
       (pred_5 obj_27)
       (pred_5 obj_19)
       (pred_5 obj_20)
       (pred_5 obj_01)
       (pred_5 obj_15)
       (pred_5 obj_17)
       (pred_5 obj_03)
       (pred_5 obj_18)
       (pred_5 obj_12)
       (pred_5 obj_26)
       (pred_5 obj_16)
       (pred_5 obj_29)
       (pred_5 obj_09)

       (pred_12  obj_07 obj_04)
       (pred_12  obj_31 obj_14)
       (pred_12  obj_10 obj_13)
       (pred_12  obj_32 obj_14)
       (pred_4 obj_07 obj_15)
       (pred_4 obj_31 obj_09)
       (pred_4 obj_10 obj_11)
       (pred_4 obj_32 obj_12)
       (pred_2 obj_29)
    )

    (:goal (and
       (pred_4 obj_07 obj_03)
    ))
(:constraints
  (always (not (pred_2 obj_17)))
)
)

; plan
1. (op_1 obj_29 obj_16)
   deleted: (pred_2 obj_29)
   added: (pred_2 obj_16)
   goals met: 0 of 1
2. (op_1 obj_16 obj_26)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_26)
   goals met: 0 of 1
3. (op_1 obj_26 obj_15)
   deleted: (pred_2 obj_26)
   added: (pred_2 obj_15)
   goals met: 0 of 1
4. (op_4 obj_15 obj_07)
   deleted: (pred_4 obj_07 obj_15) (pred_7)
   added: (pred_9 obj_07)
   goals met: 0 of 1
5. (op_1 obj_15 obj_26)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_26)
   goals met: 0 of 1
6. (op_1 obj_26 obj_16)
   deleted: (pred_2 obj_26)
   added: (pred_2 obj_16)
   goals met: 0 of 1
7. (op_1 obj_16 obj_29)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_29)
   goals met: 0 of 1
8. (op_1 obj_29 obj_03)
   deleted: (pred_2 obj_29)
   added: (pred_2 obj_03)
   goals met: 0 of 1
9. (op_2 obj_03 obj_07)
   deleted: (pred_9 obj_07)
   added: (pred_7) (pred_4 obj_07 obj_03)
   goals met: 1 of 1
